Merge pull request #118 from elimelt/feature/quartz-features-batch-4-ml
feat: Quartz features batch 4 - ML
